# ValueString Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegment..::..ValueString Property
DimensionSegment Class See Also
---
The displayed value shown for the dimension segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string ValueString { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ValueString As String
	Get
```

Visual C++
---
```text
public:
property String^ ValueString {
	String^ get ();
}
```

# See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace